In [1]:
import pandas as pd
import matplotlib.pyplot as plt

# Import Data

In [29]:
# === 40 - 70 - 40 - 80 - 40 % === #
data = pd.read_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\40_test.csv', sep="\t")

# === 40 - 90 % === #
#data = pd.read_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\50_test.csv', sep="\t")

# === 90 - 40 - 10 - 40 % === #
#data = pd.read_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\10_test.csv', sep="\t")

# === 40 - 0 - 40 % === #
#data = pd.read_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\0_test.csv', sep="\t")

## Extract useful data
- OTSV1: 3 way valve %
- TV12 : Inlet Temp to Gearbox
- TV11 : Outlet Temp from Gearbox
- OTGT1: Inlet Temp to Heat Exchanger

In [30]:
clean_data = data[['OTSV1', 'TV12', 'TV11', 'OTGT1']]
clean_data

         OTSV1   TV12   TV11  OTGT1
0           40     48  50,36  47,94
1           40     48  50,36  47,94
2           40     48  50,36  47,94
3           40     48  50,36  47,94
4           40     48  50,36  47,94
...        ...    ...    ...    ...
1769997     40  49,04  53,71  48,67
1769998     40  49,04  53,71  48,67
1769999     40  49,04  53,71  48,67
1770000     40  49,04   53,7  48,67
1770001     40  49,04   53,7  48,67

[1770002 rows x 4 columns]

## Change to correct data format
comma to period for floats: TV12, TV11, OTGT1 <br>
OTSV1 is integer --> Don't need treatment

### TV12

In [31]:
for i in range(len(clean_data[['TV12']])):
    clean_data.at[i, 'TV12'] = round(float(clean_data.at[i, 'TV12'].replace(',', '.')), 2)
    
clean_data[['TV12']]

          TV12
0           48
1           48
2           48
3           48
4           48
...        ...
1769997  49.04
1769998  49.04
1769999  49.04
1770000  49.04
1770001  49.04

[1770002 rows x 1 columns]

### TV11

In [32]:
for i in range(len(clean_data[['TV11']])):
    clean_data.at[i, 'TV11'] = round(float(clean_data.at[i, 'TV11'].replace(',', '.')), 2)

clean_data[['TV11']]

          TV11
0        50.36
1        50.36
2        50.36
3        50.36
4        50.36
...        ...
1769997  53.71
1769998  53.71
1769999  53.71
1770000   53.7
1770001   53.7

[1770002 rows x 1 columns]

### OTGT1

In [33]:
for i in range(len(clean_data[['OTGT1']])):
    clean_data.at[i, 'OTGT1'] = round(float(clean_data.at[i, 'OTGT1'].replace(',', '.')), 2)
    
clean_data[['OTGT1']]

         OTGT1
0        47.94
1        47.94
2        47.94
3        47.94
4        47.94
...        ...
1769997  48.67
1769998  48.67
1769999  48.67
1770000  48.67
1770001  48.67

[1770002 rows x 1 columns]

In [34]:
# === c_40_test ===#
clean_data.to_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\Clean_Data\c_40_test.csv', index=False, encoding='utf-8')

# === c_50_test ===#
#clean_data.to_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\Clean_Data\c_50_test.csv', index=False, encoding='utf-8')

# === c_10_test ===#
#clean_data.to_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\Clean_Data\c_10_test.csv', index=False, encoding='utf-8')

# === c_0_test ===#
#clean_data.to_csv(r'C:\Users\jerem\Documents\Python Scripts\Scania\Test_Data\Clean_Data\c_0_test.csv', index=False, encoding='utf-8')

clean_data

         OTSV1   TV12   TV11  OTGT1
0           40     48  50.36  47.94
1           40     48  50.36  47.94
2           40     48  50.36  47.94
3           40     48  50.36  47.94
4           40     48  50.36  47.94
...        ...    ...    ...    ...
1769997     40  49.04  53.71  48.67
1769998     40  49.04  53.71  48.67
1769999     40  49.04  53.71  48.67
1770000     40  49.04   53.7  48.67
1770001     40  49.04   53.7  48.67

[1770002 rows x 4 columns]

## Import Data

## Extract useful data
- OTSV1: 3 way valve %
- TV12 : Inlet Temp to Gearbox
- TV11 : Outlet Temp from Gearbox
- OTGT1: Inlet Temp to Heat Exchanger

In [13]:
clean_data = data[['OTSV1', 'TV12', 'TV11', 'OTGT1']]
clean_data

         OTSV1   TV12   TV11  OTGT1
0           90  88,35  81,25   88,5
1           90  88,35  81,25   88,5
2           90  88,35  81,25   88,5
3           90  88,35  81,25   88,5
4           90  88,35  81,25   88,5
...        ...    ...    ...    ...
1287129     40  48,44  47,82  48,14
1287130     40  48,44  47,82  48,14
1287131     40  48,44  47,82  48,14
1287132     40  48,44  47,82  48,14
1287133     40  48,44  47,82  48,14

[1287134 rows x 4 columns]

## Change to correct data format
comma to period for floats: TV12, TV11, OTGT1 <br>
OTSV1 is integer --> Don't need treatment